In [1]:
import pandas as pd

 Creating DataFrames (10 Marks)

1.Display the first 3 rows of the DataFrame. (2 Marks)  
2. Get the column names and data types. (2 Marks)  
3. Add a new column named Passed with a value of True if the Score is greater than 80, otherwise False. (3 Marks)  
4. Drop the Gender column from the DataFrame. (3 Marks)

In [2]:
#creating a dataframe with given values
scores = pd.DataFrame({'Name': ['Alice','Bob','Charlie','Diana'], 'Age': [23,25,22,24],'Gender': ['Female','Male','Male','Female'],'Score':[85,78,90,92]})
scores

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90
3    Diana   24  Female     92

In [3]:
#displaying the first three rows of the dataframe
scores.head(3)

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90

In [4]:
#column names and datatypes
print(scores.columns)
scores.dtypes

Index(['Name', 'Age', 'Gender', 'Score'], dtype='object')

Name      object
Age        int64
Gender    object
Score      int64
dtype: object

In [5]:
#adding a new column named passed with a value of true if the score is greater thaan 80 otherwise false
scores['passed'] = scores.Score>80
scores

      Name  Age  Gender  Score  passed
0    Alice   23  Female     85    True
1      Bob   25    Male     78   False
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

In [6]:
#removing the gender column from the dataframe
scores.drop('Gender',axis = 1,inplace = True)
scores

      Name  Age  Score  passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

2. Indexing and Slicing (10 Marks)

1. Select and display only the Name and Score columns. (2 Marks)  
2. Filter and display rows where Score is greater than 85. (3 Marks)  
3. Display the row for the student named "Bob" using loc. (2 Marks)  
4. Display the last 2 rows of the DataFrame. (3 Marks)

In [10]:
#selecting and displaying only the name and score columns
scores.iloc[:,0:2]
scores[["Name", "Score"]]

      Name  Score
0    Alice     85
1      Bob     78
2  Charlie     90
3    Diana     92

In [11]:
#Filtering and displaying rows where Score is greater than 85
scores[scores["Score"]>85]

      Name  Age  Score  passed
2  Charlie   22     90    True
3    Diana   24     92    True

In [16]:
#Displaying the row for the student named "Bob"
scores.loc[scores["Name"]=="Bob"]

  Name  Age  Score  passed
1  Bob   25     78   False

In [17]:
#Displaying the last 2 rows of the DataFrame
scores.iloc[-2:]

      Name  Age  Score  passed
2  Charlie   22     90    True
3    Diana   24     92    True

3. Data Analysis (15 Marks)

Calculate the average age of students. (2 Marks)  
Find the maximum and minimum scores. (2 Marks)  
Count the number of students who passed. (3 Marks)  
Group the data by the Passed column and calculate the average score for each group. (4 Marks)  
Sort the DataFrame by Score in descending order. (4 Marks)

In [24]:
#average age of the students
scores.Age.mean()
scores['Age'].mean()

23.5

In [28]:
#maximum and minimum scores
print(scores.Score.max())
scores['Score'].min()

92

78

In [30]:
#counting the number of students who passed
scores['passed'].sum()

3

In [33]:
#grouping the data by the passed column and calculating the average score
scores.groupby('passed')['Score'].mean()

passed
False    78.0
True     89.0
Name: Score, dtype: float64

In [34]:
#sorting the DataFrame by score in descending order
scores.sort_values(by='Score',ascending=False)

      Name  Age  Score  passed
3    Diana   24     92    True
2  Charlie   22     90    True
0    Alice   23     85    True
1      Bob   25     78   False

4. Importing and Exporting Data (5 Marks)

Save the DataFrame from Task 1 as a CSV file named students.csv. (2 Marks)  
Read the students.csv file back into a new DataFrame and display it. (3 Marks)

In [38]:
#saving the DataFrame as a csv file named students.csv
scores.to_csv('students.csv', index =False)

In [46]:
#reading the students.csv file 
new_scores=pd.read_csv('students.csv')
new_scores

      Name  Age  Score  passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

5. Real-World Problem (10 Marks)

Calculate a new column named Net Sales as Sales - Discount. (3 Marks)  
Group the data by Category and calculate total sales for each category. (4 Marks)  
Find the product with the highest net sales. (3 Marks)

In [41]:
#creating a data frame with given values
items = pd.DataFrame({'Product':['Laptop','Smartphone','Desk','Chair'],'Category':['Electronics','Electronics','Furniture','Furniture'],'Sales':[500,300,200,150],'Discount':[50,30,20,15]})
items

      Product     Category  Sales  Discount
0      Laptop  Electronics    500        50
1  Smartphone  Electronics    300        30
2        Desk    Furniture    200        20
3       Chair    Furniture    150        15

In [42]:
#creating a new column named net sales as sales - discount
items['Net Sales'] = items['Sales']-items['Discount']
items

      Product     Category  Sales  Discount  Net Sales
0      Laptop  Electronics    500        50        450
1  Smartphone  Electronics    300        30        270
2        Desk    Furniture    200        20        180
3       Chair    Furniture    150        15        135

In [44]:
#grouping the data by category and calculating the total sales for each category
items.groupby('Category')['Sales'].sum()

Category
Electronics    800
Furniture      350
Name: Sales, dtype: int64

In [45]:
#finding the product with maximum net sales
items.loc[items['Net Sales'].idxmax()]

Product           Laptop
Category     Electronics
Sales                500
Discount              50
Net Sales            450
Name: 0, dtype: object